import { useLocation } from "react-router-dom";

const Greeting = () => {
	const location = useLocation();

	if (location.pathname.includes("roma")) {
		return (
			<section>
				<h1>Дорогому братику!</h1>

				<p>
					Cолоденький, цей день - особливий і радісний, тож я хочу
					поділитися своєю щиросердечною вдячністю за те, що ти є в
					моєму житті. Ти - не просто друг, ти - рідкісний і
					надзвичайно цінний для мене.
				</p>

				<p>
					Твоя сила, розуміння і вірність завжди були моїм опорою, а
					твоя доброта і чесність завжди вражали мене. Ти є тим, на
					кого можна покластися в будь-який час, тим, хто завжди
					готовий допомогти і підтримати своїх друзів.
				</p>

				<p>
					Твоє весілля є свідченням твоєї неймовірної любові та
					готовності поділити своє життя з коханою людиною. Я бачу,
					яким щасливим ти виглядаєш поруч з нею, і це не може не
					тішити моє серце. Ти знайшов свою співробітницю життя, і я
					впевнений, що ваша любов буде рости та процвітати з кожним
					днем.
				</p>

				<p>
					Бажаю вам, Романе і вашій дружині, безмежного щастя, злагоди
					і взаєморозуміння. Нехай ваша подорож в браку буде сповнена
					радістю, незабутніми моментами і великими досягненнями.
					Нехай ваша сім'я буде кріпкою і щасливою.
				</p>

				<p>Щиро за вас радий! Вітаю!</p>
			</section>
		);
	}

	return <div>Greeting</div>;
};
export default Greeting;
