import { useEffect } from "react";
import { useLocation } from "react-router-dom";

const Greeting = () => {
	const location = useLocation();

	useEffect(() => {
		window.scrollTo(0, 0);
	}, []);

	if (location.pathname.includes("roma")) {
		return (
			<div className="rounded-xl border border-black/10 bg-gray-500/10 px-4 py-6 backdrop-blur-xl">
				<h1 className="mb-6 text-center font-nuni text-3xl">
					Дорогому братику!
				</h1>
				<div className="flex flex-col gap-4">
					<p className="text-lg">
						Cолоденький, цей день - особливий і радісний, тож я хочу
						поділитися своєю щиросердечною вдячністю за те, що ти є
						в моєму житті. Ти - не просто друг, ти - рідкісний і
						надзвичайно цінний для мене.
					</p>

					<p className="text-lg">
						Твоя сила, розуміння і вірність завжди були моєю опорою,
						а твоя доброта і чесність завжди вражали мене. Ти є тим,
						на кого можна покластися в будь-який час, тим, хто
						завжди готовий допомогти і підтримати своїх друзів.
					</p>

					<p className="text-lg">
						Твоє весілля є свідченням твоєї неймовірної любові та
						готовності поділити своє життя з коханою людиною. Я
						бачу, яким щасливим ти виглядаєш поруч з нею, і це не
						може не тішити мене. Ти знайшов свою половинку, і я
						впевнений, що ваша любов буде з кожним днем лише все
						більше рости й процвітати.
					</p>

					<p className="mb-8 text-lg">
						Бажаю Вам безмежного щастя,
						злагоди і взаєморозуміння. Нехай ваша подорож
						буде сповнена радістю, незабутніми моментами і великими
						досягненнями. Нехай ваша сім'я буде кріпкою і щасливою.
					</p>

					<p className="text-center font-nuni text-2xl">
						Щиро за вас радий!
					</p>
					<p className="text-center font-nuni text-3xl">Вітаю!</p>
				</div>
			</div>
		);
	}

	return (
		<div className="rounded-xl border border-black/10 bg-gray-500/10 px-4 py-6 backdrop-blur-xl">
			<h1 className="mb-6 text-center font-nuni text-3xl">
				Найкращій сусідці по парті, та загалом неймовірно гарній
				дівчині!
			</h1>
			<div className="flex flex-col gap-4">
				<p className="text-lg">
					Ваша дорога до шлюбу - це справжній казковий 'роман'😏, в
					якому кожен момент наповнений коханням і ніжністю. Я з
					радістю спостерігатиму за вашим щастям, в цей особливий
					день!
				</p>

				<p className="text-lg">
					Яна, ти завжди була образом гармонії та дбайливості. Твоя
					краса не лише в зовнішності, але і в тому, як ти завжди
					доглядаєш за іншими. Ти - дивовижна дівчина, яка дарує тепло
					та розуміння всім, хто має щастя знати тебе. Ромі дуже
					пощастило прийняти тебе в своє життя, адже твоє кохання -
					справжній скарб.
				</p>

				<p className="text-lg">
					Наші спільні шкільні роки були яскравими завдяки тобі, Яно.
					Саме завдяки тобі, я зміг адаптуватися до нового оточення,
					ти стала моїм провідником) Мені було досить приємно
					проводити з тобою шкільні будні за однією партою, нерідко
					саме твоя присутність виправляла мій день!
				</p>

				<p className="mb-8 text-lg">
					Бажаю вам, Яна і Рома, щоб ваш шлюб був наповнений коханням,
					взаєморозумінням і радістю, і щоб кожен день цього нового
					етапу вашого життя був таким, як перший - сповнений любові,
					надії та метеликів в животі.
				</p>

				<p className="text-center font-nuni text-2xl">
					Щиро за вас радий!
				</p>
				<p className="text-center font-nuni text-3xl">Вітаю!</p>
			</div>
		</div>
	);
};
export default Greeting;
