import {useEffect} from 'react'
import { useLocation } from "react-router-dom";

const Greeting = () => {
	const location = useLocation();

    useEffect(() => {
        window.scrollTo(0, 0)

    }, [])
    

	if (location.pathname.includes("roma")) {
		return (
			<div className="rounded-xl border border-black/10 bg-gray-500/10 px-4 py-6 backdrop-blur-xl">
				<h1 className="mb-6 text-center font-nuni text-3xl">
					Дорогому братику!
				</h1>
				<div className="flex flex-col gap-4">
					<p className="text-lg">
						Cолоденький, цей день - особливий і радісний, тож я хочу
						поділитися своєю щиросердечною вдячністю за те, що ти є
						в моєму житті. Ти - не просто друг, ти - рідкісний і
						надзвичайно цінний для мене.
					</p>

					<p className="text-lg">
						Твоя сила, розуміння і вірність завжди були моїм опорою,
						а твоя доброта і чесність завжди вражали мене. Ти є тим,
						на кого можна покластися в будь-який час, тим, хто
						завжди готовий допомогти і підтримати своїх друзів.
					</p>

					<p className="text-lg">
						Твоє весілля є свідченням твоєї неймовірної любові та
						готовності поділити своє життя з коханою людиною. Я
						бачу, яким щасливим ти виглядаєш поруч з нею, і це не
						може не тішити моє серце. Ти знайшов свою співробітницю
						життя, і я впевнений, що ваша любов буде рости та
						процвітати з кожним днем.
					</p>

					<p className="mb-8 text-lg">
						Бажаю вам, Романе і вашій дружині, безмежного щастя,
						злагоди і взаєморозуміння. Нехай ваша подорож в браку
						буде сповнена радістю, незабутніми моментами і великими
						досягненнями. Нехай ваша сім'я буде кріпкою і щасливою.
					</p>

					<p className="text-center font-nuni text-2xl">
						Щиро за вас радий!
					</p>
					<p className="text-center font-nuni text-3xl">Вітаю!</p>
				</div>
			</div>
		);
	}

	return (
		<div className="rounded-xl border border-black/10 bg-gray-500/10 px-4 py-6 backdrop-blur-xl">
			<h1 className="mb-6 text-center font-nuni text-3xl">
				Найліпгій сусідці по парті, та загалом неймовірно гарній дівчині!
			</h1>
			<div className="flex flex-col gap-4">
				<p className="text-lg">
					Cолоденький, цей день - особливий і радісний, тож я хочу
					поділитися своєю щиросердечною вдячністю за те, що ти є в
					моєму житті. Ти - не просто друг, ти - рідкісний і
					надзвичайно цінний для мене.
				</p>

				<p className="text-lg">
					Твоя сила, розуміння і вірність завжди були моїм опорою, а
					твоя доброта і чесність завжди вражали мене. Ти є тим, на
					кого можна покластися в будь-який час, тим, хто завжди
					готовий допомогти і підтримати своїх друзів.
				</p>

				<p className="text-lg">
					Твоє весілля є свідченням твоєї неймовірної любові та
					готовності поділити своє життя з коханою людиною. Я бачу,
					яким щасливим ти виглядаєш поруч з нею, і це не може не
					тішити моє серце. Ти знайшов свою співробітницю життя, і я
					впевнений, що ваша любов буде рости та процвітати з кожним
					днем.
				</p>

				<p className="mb-8 text-lg">
					Бажаю вам, Романе і вашій дружині, безмежного щастя, злагоди
					і взаєморозуміння. Нехай ваша подорож в браку буде сповнена
					радістю, незабутніми моментами і великими досягненнями.
					Нехай ваша сім'я буде кріпкою і щасливою.
				</p>

				<p className="text-center font-nuni text-2xl">
					Щиро за вас радий!
				</p>
				<p className="text-center font-nuni text-3xl">Вітаю!</p>
			</div>
		</div>
	);
};
export default Greeting;
